/*
Задание 4. С клавиатуры вводятся X, Y, R. Определить, принадлежит ли 
точка с координатами (X,Y) заштрихованной части плоскости
*/

#include <iostream>
#include <cmath>

int main() 
{
    double x, y, r;
    char choice;

    do 
    {
        std::cout << "Введите координату X: ";
        std::cin >> x;

        std::cout << "Введите координату Y: ";
        std::cin >> y;

        std::cout << "Введите радиус R: ";
        std::cin >> r;

        // Проверяем условие принадлежности точки к заштрихованной области
        if ((x >= 0) && (y >= 0) && (sqrt(x * x + y * y) <= r)) 
        {
            std::cout << "Точка (" << x << ", " << y << ") принадлежит заштрихованной части плоскости.\n";
        } 
        else 
        {
            std::cout << "Точка (" << x << ", " << y << ") не принадлежит заштрихованной части плоскости.\n";
        }

        std::cout << "Хотите продолжить? (y/n): ";
        std::cin >> choice;
    } 
    while (choice == 'y' || choice == 'Y');

    return 0;
}
